In [1]:
#Pandas learning from code basics 
# basics of pandas tutorial youtube channel 

import pandas as pd
df = pd.read_csv("C:\\Users\\DeLL\\Documents\\weather.csv")

In [14]:
df['Temperature'].max()

50

In [15]:
df['EST'][df['Events']=='Rain']

8     01-09-2016
9     01-10-2016
15     1/16/2016
26     1/27/2016
Name: EST, dtype: object

In [16]:
df.fillna(0,inplace=True)
df.mean()

Temperature              34.677419
DewPoint                 17.838710
Humidity                 51.677419
Sea Level PressureIn     29.992903
VisibilityMiles           9.193548
WindSpeedMPH              6.225806
CloudCover                3.129032
WindDirDegrees          247.129032
dtype: float64

In [3]:
weather_data = {
    'day' : ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temprature':[32,35,28,24,32,31],
    'windspeed' : [6,7,2,7,4,2],
    'events' : ['Rain','Sunny','Snow','snow','Rain','Sunny']
}
df = pd.DataFrame(weather_data)
df

        day  temprature  windspeed events
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   snow
4  1/5/2017          32          4   Rain
5  1/6/2017          31          2  Sunny

In [19]:
df.head()

        day  temprature  windspeed events
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   snow
4  1/5/2017          32          4   Rain

In [20]:
df.head(2)

        day  temprature  windspeed events
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny

In [22]:
df.tail(3)

        day  temprature  windspeed events
3  1/4/2017          24          7   snow
4  1/5/2017          32          4   Rain
5  1/6/2017          31          2  Sunny

In [21]:
df.tail()

        day  temprature  windspeed events
1  1/2/2017          35          7  Sunny
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   snow
4  1/5/2017          32          4   Rain
5  1/6/2017          31          2  Sunny

In [23]:
df[2:5] # from row 2 to 4

        day  temprature  windspeed events
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   snow
4  1/5/2017          32          4   Rain

In [24]:
df.columns

Index(['day', 'temprature', 'windspeed', 'events'], dtype='object')

In [27]:
df['events']

0     Rain
1    Sunny
2     Snow
3     snow
4     Rain
5    Sunny
Name: events, dtype: object

In [28]:
type(df['events'])

pandas.core.series.Series

In [31]:
df[['events','day']]

  events       day
0   Rain  1/1/2017
1  Sunny  1/2/2017
2   Snow  1/3/2017
3   snow  1/4/2017
4   Rain  1/5/2017
5  Sunny  1/6/2017

In [32]:
df['temprature'].max()

35

In [33]:
df['temprature'].mean()

30.333333333333332

In [34]:
df['temprature'].std()

3.8297084310253524

In [35]:
df.describe()

       temprature  windspeed
count    6.000000   6.000000
mean    30.333333   4.666667
std      3.829708   2.338090
min     24.000000   2.000000
25%     28.750000   2.500000
50%     31.500000   5.000000
75%     32.000000   6.750000
max     35.000000   7.000000

In [37]:
df[df.temprature>=32]
df[df['temprature']>=32]   # both are same

        day  temprature  windspeed events
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny
4  1/5/2017          32          4   Rain

In [40]:
df[df['temprature']==df.temprature.max()]
df[df['temprature']==df['temprature'].max()]
df[df.temprature==df.temprature.max()]  # all these three are same

        day  temprature  windspeed events
1  1/2/2017          35          7  Sunny

In [41]:
df[['day','temprature']][df['temprature']==df.temprature.max()] # only day and temprature where temprature is maximum

        day  temprature
1  1/2/2017          35

In [44]:
df[['day','events']][df.temprature==df.temprature.max()] # only day and events where temprature is maximum

        day events
1  1/2/2017  Sunny

In [45]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [46]:
df.set_index('day',inplace=True)

          temprature  windspeed events
day
1/1/2017          32          6   Rain
1/2/2017          35          7  Sunny
1/3/2017          28          2   Snow
1/4/2017          24          7   snow
1/5/2017          32          4   Rain
1/6/2017          31          2  Sunny

In [48]:
df

        day  temprature  windspeed events
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   snow
4  1/5/2017          32          4   Rain
5  1/6/2017          31          2  Sunny

In [52]:
df.loc[2][3]  # we can look data farme as 2d matrix using loc

'Snow'

In [ ]:
# we can create the dataframe using 
#1) csv file 
#2) xlsx file 
#3) usin pyton dictionary 
#4) using tuples
#5) using pdf  for more google pandas io

In [ ]:
#reading csv file 
df = pd.read_csv('')

In [8]:
stock_data = {
    "tickers" : ['GOOGLE',"WMT",'MSFT','RIL','TATA'],
    'eps' : [27.82,4.61,-1,"not available",5.6],
    'revenue' : [87,484,85,50,-1],
    'price' : [845,65,64,1023,'n.a'],
    'people': ['larry page','n.a','bill gates','mukesh ambani','ratan tata']
}
df = pd.DataFrame(stock_data)
df

  tickers            eps  revenue price         people
0  GOOGLE          27.82       87   845     larry page
1     WMT           4.61      484    65            n.a
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1   n.a     ratan tata

In [48]:
# save dataframe to csv file
df.to_csv('stock_data',index = False)

In [49]:
df = pd.read_csv('stock_data')
df

  tickers    eps  revenue   price         people
0  GOOGLE  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT    NaN     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [41]:
del df['Unnamed: 0'] # delete the unwanted column

In [50]:
#clening the na and not available values at the time of reading the csv file
df = pd.read_csv('stock_data',na_values = ['not available','n.a',-1])
df

  tickers    eps  revenue   price         people
0  GOOGLE  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT    NaN     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [52]:
del df['tickers'] 
df

     eps  revenue   price         people
0  27.82     87.0   845.0     larry page
1   4.61    484.0    65.0            NaN
2    NaN     85.0    64.0     bill gates
3    NaN     50.0  1023.0  mukesh ambani
4   5.60      NaN     NaN     ratan tata

In [53]:
# we can supply a dictonary for cleaning the particular column as specified by user
df = pd.read_csv('stock_data',na_values ={
    'eps':['-1','not_available','not available','n.a',''],
    'revenue':['-1','not available','inf'],
    'price' :['-1','not-available','inf','n.a',''],
    'people':['n.a','nan','not_available','non','NIL','nil']
})
df

  tickers    eps  revenue   price         people
0  GOOGLE  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT    NaN     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [47]:
del df['Unnamed: 0']
df

  tickers    eps  revenue   price         people
0  GOOGLE  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT    NaN     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [63]:
#while reading the csv file we can write a function for each column to tranform the column data 
# according to requirement
def convert_people_cell(cell):
    if cell=='n.a':
        return "vicky"
    return cell
df = pd.read_csv('stock_data',converters = {
    'people' : convert_people_cell
})
df

  tickers    eps  revenue   price         people
0  GOOGLE  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0
2    MSFT    NaN     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [64]:
#handling missing vlaues
weather_data = {
    'day' : ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017','1/10/2017','1/11/2017','1/12/2017'],
    'temprature':[32,35,28,24,32,31,'',45, ''],
    'windspeed' : [6,7,2,'',7,4,'',2,4],
    'events' : ['Rain','','Sunny','Snow','snow','','Rain','Sunny','']
}
df = pd.DataFrame(weather_data)
df

         day temprature windspeed events
0   1/1/2017         32         6   Rain
1   1/2/2017         35         7
2   1/3/2017         28         2  Sunny
3   1/4/2017         24             Snow
4   1/5/2017         32         7   snow
5   1/6/2017         31         4
6  1/10/2017                        Rain
7  1/11/2017         45         2  Sunny
8  1/12/2017                    4